# NEW-132
# app/locales/ru/main.ftl

# --- Общие сообщения ---
welcome-message = 🙋‍♂️ Добро пожаловать! Используйте меню ниже, чтобы начать.
language-changed-message = ✅ Язык бота изменен на Русский.
unknown-command-message = ❓ Неизвестная команда. Вернитесь в главное меню.
functionality-in-development = 🛠️ Эта функция находится в разработке.
error-occurred = ❗️ Произошла ошибка. Пожалуйста, попробуйте еще раз.
main-menu-message = 🏡 Главное меню.

# --- Сообщения для процесса голосования ---
ask-phone-number = ✍️ Пожалуйста, введите ваш номер телефона для голосования. Пример: 911234567
phone-number-invalid = 🚫 Неверный формат номера. Пожалуйста, введите в формате +9989X XXX XX XX.
ask-captcha-result = 🤖 В целях безопасности, пожалуйста, введите цифры с картинки.
captcha-invalid = ❌ Неверная CAPTCHA. Пожалуйста, попробуйте еще раз.
ask-otp-code = ⏳ Пожалуйста, введите 6-значный SMS-код, отправленный на ваш телефон.
otp-invalid = ❌ Неверный SMS-код. Пожалуйста, попробуйте еще раз.
phone-already-used = ⚠️ Этот номер телефона уже использовался для голосования.
vote-successful = ✅ Ваш голос успешно принят! На ваш баланс добавлено {amount} сум.
api-error = ❗️ На сайте Openbudget произошла ошибка. Пожалуйста, попробуйте позже.

# --- Сообщения для аккаунта и рефералов ---
account-info-message = 💰 Ваш текущий баланс: {balance} сум.
referral-info-message = 🔗 Приглашайте друзей по вашей реферальной ссылке и зарабатывайте деньги!\nЗа каждого реферала вы получите {amount} сум.\n\nВаша ссылка:\n{link}

# --- Сообщения для админ-панели ---
admin-panel-message = 🔐 Админ-панель.
stats-message = 📊 Статистика:
send-notification-message = 📢 Пожалуйста, введите сообщение для отправки пользователям.
notification-sent-message = ✅ Сообщение отправлено пользователям.

# --- Другие сообщения ---
cancel-action = ❌ Действие отменено.
confirm-action = ✅ Подтверждено.
help-message = ❓ Помощь по использованию бота.
